/**
 *****************************************
 * Created by lifx
 * Created on 2018-06-06 11:45:49
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import History from './history';


/**
 *****************************************
 * 创建历史对象
 *****************************************
 */
let history = new History();

console.log(history.state);

history.subscribe(() => {
    console.log(history.state);
});
