/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2018-11-10 18:15:36
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import HashHistory from './utils/history';


/**
 *****************************************
 * 抛出接口
 *****************************************
 */
export default function createHashHistory() {
    return new HashHistory();
}
