/**
 *****************************************
 * Created by lifx
 * Created on 2018-06-15 16:02:08
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
import createRouter from '../lib';


/**
 *****************************************
 * 创建路由
 *****************************************
 */
let router = createRouter();


console.log(router.state);

router.subscribe(() => {
    console.log(router.state);
});
